IRP/src/ChartsOfCharacteristicTypes/IDInfoTypes/IDInfoTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>IDInfoTypes</name>
  <type>
    <types>CatalogRef.IDInfoAddresses</types>
    <types>String</types>
    <stringQualifiers>
      <length>512</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowOnForm</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ReadOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ExternalDataProcess</name>
    <attributes>
      <name>Country</name>
      <type>
        <types>CatalogRef.Countries</types>
      </type>
    </attributes>
    <attributes>
      <name>ExternalDataProc</name>
      <type>
        <types>CatalogRef.ExternalDataProc</types>
      </type>
    </attributes>
    <attributes>
      <name>Settings</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RelatedValues</name>
    <attributes>
      <name>IDInfoType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.IDInfoTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

IRP/src/ChartsOfCharacteristicTypes/IDInfoTypes/Forms/SelectCountryForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	For Each Row In Parameters.ArrayOfCountry Do
		NewRow = ThisObject.CountryTable.Add();
		NewRow.Country = Row.Country;
		NewRow.ExternalDataProc = Row.ExternalDataProc;
		NewRow.Settings = Row.Settings;
	EndDo;
EndProcedure

&AtClient
Procedure CountryTableSelection(Item, RowSelected, Field, StandardProcessing)
	StandardProcessing = False;
	Result = New Structure();
	Result.Insert("Country", Item.CurrentData.Country);
	Result.Insert("ExternalDataProc", Item.CurrentData.ExternalDataProc);
	Result.Insert("Settings", Item.CurrentData.Settings);
	ThisObject.Close(Result);
EndProcedure
